# GetSecondProfileCurve Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RuledSurface..::..GetSecondProfileCurve Method
RuledSurface Class See Also
---
Returns a copy of the second profile curve if it is set.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public Curve GetSecondProfileCurve()
```

Visual Basic
---
```text
Public Function GetSecondProfileCurve As Curve
```

Visual C++
---
```text
public:
Curve^ GetSecondProfileCurve()
```

# ### Return Value
A copy of the second profile curve, if it exists. If a point was used to define the second profile, this function will return nullNothingnullptra null reference (Nothing in Visual Basic).
# See Also
RuledSurface Class
Autodesk.Revit.DB Namespace